Merge pull request #6 from oplanson/feature/code-optimization
Feature/code optimization
